Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: Call hasher.combine(_:) with each of these components.
ja: hasher.combine(_:)をそれら構成要素とともに呼び出してください。

source: Call the dismiss() method to dismiss the interface programmatically.
ja: dismiss()メソッドを呼び出して、インターフェイスをプログラムに基づいて退出させてください。

source: Call this method to mark the views of the hosting controller as needing an update.
ja: このメソッドを呼び出して、ホスティングコントローラのビューそれらを更新が必要であると印してください。

source: Call this method to reload the entire contents of your app's page-based interface.
ja: このメソッドを呼び出して、あなたのアプリのもつページ基盤のインターフェイスの内容全体をリロードしてください。

source: Called as a validated drop moves inside the onDrop modified view.
ja: 有効なドロップ移動がonDrop修正されたビュー内に移動するときに呼び出されます。

source: Called immediately before the view’s body() function is executed, after updating the values of any link variables stored in self.
ja: ビューのもつbody()関数が遂行される直前に、selfの中に格納されるあらゆるリンク変数の値を更新する後に、呼び出されます。

source: Called when a drop, which has items conforming to any of the types passed to the onDrop() modifier, enters an onDrop target.
ja: onDrop()修飾子に渡される型のいずれかに準拠している項目を持つあるドロップが、onDropターゲットに入る時に呼び出されます。

source: Calling the related sorted() method is equivalent to calling this method and passing the less-than operator (<) as the predicate.
ja: 関連したsorted()メソッドを呼び出すことは、このメソッドを呼び出して、より小さい演算子（<）を述部として渡すことと等しいです。

source: Calling this method defines a region for detecting pointer movement with the size and position of this view.
ja: このメソッドを呼び出すことは、ポインタの動きを検出するための領域を、このビューの大きさと位置で定義します。

source: Calling this method forces the hosting controller to update its current set of views, but only if there are pending changes.
ja: このメソッドを呼び出すことは、それの現在の一揃いのビューを更新することをホスティングコントローラに強制します、もしそれらが変更を未解決ならば。

source: Calls body with each element in the path.
ja: bodyをこのパスの中の各要素で呼び出します。

source: Calls the given closure on each element in the sequence in the same order as a for-in loop.
ja: 指定されたクロージャをそのシーケンスの各要素上でfor-inループと同じ順番で呼び出します。

source: Cancel the drag operation and transfer no data.
ja: ドラッグ操作を取り消して、少しもデータを転送しません。

source: Center the preview in a container the size of the device on which the preview is running.
ja: プレビューを、それの上でプレビューが動作しているデバイスの大きさのコンテナの中心に置きます。

source: Center the preview in a fixed size container.
ja: プレビューをある治された大きさのコンテナの中心に置きます。

source: Change Management
ja: 変化管理

source: Change the baseline offset to move the text in the view (in points) up or down relative to its baseline.
ja: ベースライン相殺を変更して、テキストをビューにおいて上または下へとそれのベースラインに相対して移動します。

source: Changes the relative position of this shape using the specified coordinates.
ja: この形状の相対位置をこの指定された座標を使って変更します。

source: Changes the relative position of this shape using the specified point.
ja: この形状の相対位置をこの指定された地点を使って変更します。

source: Changes the relative position of this shape using the specified size.
ja: この形状の相対位置をこの指定された大きさを使って変更します。

source: Changes the view’s proposed area to extend outside the screen’s safe areas.
ja: ビューのもつ提案領域を変更して、画面のもつ安全領域の外側に拡張します。

source: Changing color saturation increases or decreases the intensity of colors in a view.
ja: 色彩度の変更は、ビューにおける色の強烈さを漸増または漸減します。

source: Changing the alignment of one view may have effects on surrounding views.
ja: あるビューの整列を変更することは、周りのビューに影響を与えるかもしれません。

source: Changing the parameters of trim(from:to:) to .trim(from: 0, to: 1) draws the full infinity symbol, while .trim(from: 0, to: 0.5) draws only the left lobe of the symbol.
ja: trim(from:to:)のパラメータを.trim(from: 0, to: 1)に変えることは、完全な無限記号を描画します、一方で.trim(from: 0, to: 0.5)は記号の左の丸突出部だけを描画します。

source: Changing the property updates the value of the corresponding SwiftUI variable.
ja: プロパティを変更することは、対応するSwiftUI変数の値を更新します。

source: Character Representation
ja: 文字表現

source: Character set containing the characters the scanner ignores when looking for a scannable element.
ja: あるスキャン可能な要素を捜すときにスキャナが無視する文字を含んでいる文字集合。

source: Characters in the skip set are skipped over before the target is scanned.
ja: 省く集合の中の文字は、対象がスキャンされる前に省かれます。

source: Checking Presentation
ja: 提示を確認する

source: Checking for Editing Mode
ja: 編集モードを確認する

source: Checking for Items
ja: 項目を確認する

source: Choosing Date Picker Components
ja: 日付ピッカー構成要素を選択する

source: Choosing a Content Mode
ja: コンテンツモードを選ぶ

source: Choosing a Font
ja: フォントを選ぶ

source: Choosing a Font Design
ja: フォントデザインを選ぶ

source: Choosing a Font Style
ja: フォントスタイルを選ぶ

source: Choosing a Font Weight
ja: フォントウェイトを選ぶ

source: Choosing a Layout
ja: レイアウトを選ぶ

source: Choosing a Size Category
ja: サイズカテゴリを選ぶ

source: Choosing a Title Display Mode
ja: タイトル表示モードを選ぶ

source: Choosing an Operating System
ja: オペレーティングシステムを選ぶ

source: Class factory methods of XMLNode enable you to create nodes of each kind.
ja: XMLNodeのクラスファクトリメソッドは、あなたに各種のノードを作成させます。

source: Classes Bridged to Swift Standard Library Value Types
ja: Swift標準ライブラリ値型にブリッジするクラス

source: Cleaning Up the Interface Object
ja: インターフェイスオブジェクトをきれいに片付ける

source: Cleaning Up the View
ja: ビューをきれいに片付ける

source: Cleaning Up the View Controller
ja: ビューコントローラをきれいに片付ける

source: Cleans up the presented NSViewController (and coordinator) in anticipation of their removal.
ja: 提示されたNSViewController（そしてコーディネータ）をそれらの除去を見越してきれいに片付けます。

source: Cleans up the presented AppKit view (and coordinator) in anticipation of their removal.
ja: 提示されたビュー（そしてコーディネータ）をそれらの除去を見越してきれいに片付けます。

source: Cleans up the presented UIKit view (and coordinator) in anticipation of their removal.
ja: 提示されたUIKitビュー（そしてコーディネータ）をそれらの除去を見越してきれいに片付けます。

source: Cleans up the presented WatchKit interface object (and its coordinator) in anticipation of their removal.
ja: 提示されたWatchKitインターフェイスオブジェクト（そしてそれのコーディネータ）をそれらの除去を見越してきれいに片付けます。

source: Cleans up the presented interface object (and coordinator) in anticipation of their removal.
ja: 提示されたインターフェイスオブジェクト（そしてコーディネータ）をそれらの除去を見越してきれいに片付けます。

source: Cleans up the presented view controller (and coordinator) in anticipation of its removal.
ja: 提示されたビューコントローラ（そしてコーディネータ）をそれの除去を見越してきれいに片付けます。

source: Cleans up the presented view controller (and coordinator) in anticipation of their removal.
ja: 提示されたビューコントローラ（そしてコーディネータ）をそれらの除去を見越してきれいに片付けます。

source: Clients of this function can use multiple-statement closures to provide several child views, as shown in the following example:
ja: この関数のクライアントは、複数文のクロージャを使って幾つかの子ビューを生み出せます、以下の例で示されるように：

source: Clips the view to its bounding frame, with the specified corner radius.
ja: ビューをそれの境界枠に切り抜きます、この指定された角丸めで。

source: Clips the view to its bounding rectangular frame.
ja: ビューをそれの境界矩形枠に切り抜きます。

source: Clips this view to its bounding frame, with the specified corner radius.
ja: このビューをそれの境界枠へと切り抜きます、この指定された角丸めで。

source: Clips this view to its bounding rectangular frame.
ja: このbkビューをそれの境界矩形枠に切り抜きます。

source: Close
ja: 閉じる

source: Closes and completes the current subpath.
ja: 現在のサブパスを閉じて完了します。

source: Coalesces adjacent text nodes of the receiver that you have explicitly added, optionally including CDATA sections.
ja: レシーバの近接のテキストノードを結合します、それはあなたが明示的に加えたものです、随意にCDATAセクションを含みます。

source: Combine gestures to create complex interactions.
ja: ジェスチャそれらを結合して複雑な相互作用を作成します。

source: Combine views in stacks, generate groups and lists of views dynamically, and define view presentations and hierarchy.
ja: ビューをスタックにおいて組み合わせて、ビューのグループとリストを動的に生成して、そしてビューの提示と階層を定義してください。

source: Combine views using containers that specify their visual relationships and hierarchy.
ja: ビューそれらを、それらの視覚的関係および階層を指定するあるコンテナを使って組み合わせて下さい。

source: Combined Gestures
ja: 結合されたジェスチャ

source: Combines a gesture with another gesture to create a new gesture that recognizes both gestures at the same time.
ja: あるジェスチャを別のジェスチャと結合して、両方のジェスチャを同時に認識する新しいジェスチャを作成します。

source: Combines a gesture with keyboard modifiers.
ja: あるジェスチャをキーボード修飾子と結合します。

source: Combines a sequence of values by modifying the previously-accumulated value with the result of a closure that provides the next value.
ja: 以前に集積された値を次の値を提供するあるクロージャの結果で修正することによって、値いくつかからなるあるシーケンスを結合します。

source: Combines this transition with another, returning a new transition that is the result of both transitions being applied.
ja: この遷移と別のものを結合します、新しい遷移を返します、それは両方の遷移が適用されることの結果です。

source: Combines two gestures exclusively to create a new gesture where only one gesture succeeds, giving precedence to the first gesture.
ja: ２つのジェスチャを排他的に結合して、新しいジェスチャを作成します、そこではただ１つのジェスチャだけが成功します、最初のジェスチャに優先権を与えます。

source: Combining Sets
ja: 集合を結合する

source: Combining Text Views
ja: テキストビューを組み合わせる

source: Combining child views may remove an implicit value produced by using the default.
ja: 子ビューを結合することは、省略時の値を使うことによって生み出された暗黙的な値を除去するかもしれません。

source: Command groups describe additional groupings of controls to add to existing command menus.
ja: コマンドグループは、既存のコマンドメニューに加えるコントロールいくつかからなる追加のグループを記述します。

source: Command menus are stand-alone, top-level containers for controls that perform related, app-specific commands.
ja: コマンドメニューは、関連した、アプリ特定のコマンドを実行するコントロールに対する単独動作型の、トップレベルコンテナです。

source: Communicates to the user what happens after performing the view’s action.
ja: ビューのもつアクションを実行する後に何が起こるかユーザに伝えます。

source: Comparing Adjustment Directions
ja: 調節方向を比較する

source: Comparing Color Rendering Modes
ja: 色描出モードを比較する

source: Comparing Color Scheme Contrasts
ja: カラースキームコントラストを比較する

source: Comparing Colors
ja: 色を比較する

source: Comparing Content Modes
ja: コンテンツモードを比較する

source: Comparing Content Size Categories
ja: コンテンツサイズカテゴリを比較する

source: Comparing Control Active States
ja: コントロールアクティブ状態を比較する

source: Comparing Drop Operations
ja: ドロップ操作を比較する

source: Comparing Edit Modes
ja: 編集モードを比較する

source: Comparing Font Designs
ja: フォントデザインを比較する

source: Comparing Font Weights
ja: フォントウェイトを比較する

source: Comparing Fonts
ja: フォントを比較する

source: Comparing Images
ja: 画像を比較する

source: Comparing Interface Controllers
ja: インターフェイスコントローラを比較する

source: Comparing Interpolation
ja: 補間を比較する

source: Comparing Layout Directions
ja: レイアウト方向を比較する

source: Comparing Legibility Weights
ja: 視認ウェイトを比較する

source: Comparing Modified Content Views
ja: 修正されたコンテンツビューを比較する

source: Comparing Paths
ja: パスを比較する

source: Comparing Preview Platforms
ja: プレビュープラットホームを比較する

source: Comparing Resizing Modes
ja: リサイズモードを比較する

source: Comparing Scales
ja: 縮尺を比較する

source: Comparing Sets
ja: 集合を比較する

source: Comparing Size Classes
ja: サイズクラスを比較する

source: Comparing Template Rendering Modes
ja: ひな型描出モードを比較する

source: Comparing Text Styles
ja: テキストスタイルを比較する

source: Comparing Text Views
ja: テキストビューを比較する

source: Comparing Title Display Modes
ja: タイトル表示モードを比較する

source: Comparing Truncation Modes
ja: 切り詰めモードを比較する

source: Comparing Values
ja: 値の比較

source: Comparing View Controllers
ja: ビューコントローラを比較する

source: Comparing View Dimensions
ja: ビュー寸法を比較する

source: Comparing Views
ja: ビューを比較する

source: Complexity: O(1)
ja: 計算量：O(1)

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is equal to maxLength.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、ここでkはmaxLengthに等しいです。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the absolute value of distance.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、そこでkはdistanceの値の絶対値です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to drop from the beginning of the collection.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、ここでkはコレクションの冒頭から除外する要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to drop.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、ここでkは除外する要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(k), where k is the number of elements to select from the beginning of the collection.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(k)、ここでkはコレクションの冒頭から選ぶ要素の数です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(n), where n is the length of the collection.
ja: 計算量：コレクションがRandomAccessCollectionに準拠するならば、O(1)；そうでなければ、O(n)、そこでnはコレクションの長さです。

source: Complexity: O(m + n), where n is the length of this sequence and m is the length of the result.
ja: 計算量：O(m + n)、ここでnはこのシーケンスの長さで、mは結果の長さです。

source: Complexity: O(m), where m is the lesser of the length of the sequence and the length of other.
ja: 計算量：O(m)、ここでmはシーケンスの長さおよびotherの長さより少ないものです。

source: Complexity: O(m), where m is the lesser of the length of the sequence and the length of possiblePrefix.
ja: 計算量：O(m)、ここでmはシーケンスの長さおよびpossiblePrefixの長さより少ないものです。

source: Complexity: O(n log n), where n is the length of the sequence.
ja: 計算量：O(n log n)、ここでnはシーケンスの長さです。

source: Complexity: O(n), where n is the length of the collection.
ja: 計算量：O(n)、ここでnはコレクションの長さです。

source: Complexity: O(n), where n is the length of the sequence.
ja: 計算量：O(n)、ここでnはシーケンスの長さです。

source: Complexity: Worst case performance is O(n * m), where n is the count of this collection and m is other.count.
ja: 計算量：最悪の場合の性能は、O(n * m)です、ここでnはこのコレクションの総数です、そしてmはother.countです。

source: Composing Complex Interfaces
ja: 複雑なインターフェイスを構成する

source: Composing Gestures
ja: ジェスチャを構成する

source: Composing SwiftUI Gestures
ja: SwiftUIジェスチャを合成する

source: Composites the view’s contents into an offscreen image before final display.
ja: ビューのもつ内容をある画面外の画像へと最終的表示の前に合成します。

source: Composites this view’s contents into an offscreen image before final display.
ja: このビューのもつ内容をある画面外の画像へと最終的表示の前に合成します。

source: Compositing Views
ja: ビューを合成する

source: Concatenates the text in two text views in a new text view.
ja: ２つのテキストビューの中のテキストをある新しいテキストビューにおいて連結します。

source: Conditionally Visible Items
ja: 条件付きで見ることができる項目

source: Configure the Sample Code Project
ja: 見本のコードプロジェクトを構成設定する

source: Configure the object using your app's current data and contents of the context parameter.
ja: オブジェクトをあなたのアプリのもつ現在のデータとこのcontextパラメータの内容を使って構成設定してください。

source: Configure the view using your app's current data and contents of the context parameter.
ja: ビューをあなたのアプリのもつ現在のデータとこのcontextパラメータの内容を使って構成設定してください。

source: Configure this view and the views it contains by applying standard modifiers.
ja: このビューとそれが含むいくつかのビューを標準修飾子を適用することによって構成設定します。

source: Configures the navigation bar items for the view.
ja: ビューに対してナビゲーションバー項目を構成設定します。

source: Configures the navigation bar items for this view.
ja: ナビゲーションバー項目をこのビューに対して構成設定します。

source: Configures the title display mode for this view.
ja: このビューに対するタイトル表示モードを構成設定します。

source: Configures the title in the navigation bar for the view.
ja: ビューに対してナビゲーションバーにおけるタイトルを構成設定します。

source: Configures the title of the navigation bar for the view.
ja: ビューに対してナビゲーションバーのタイトルを構成設定します。

source: Configures the title of this view's navigation bar with a localized string and a display mode.
ja: このビューのもつナビゲーションバーのタイトルをローカライズされた文字列とある表示モードで構成設定します。

source: Configures the title of this view's navigation bar with a localized string.
ja: このビューのもつナビゲーションバーのタイトルをローカライズされた文字列で構成設定します。

source: Configures the title of this view’s navigation bar with a string.
ja: このビューのもつナビゲーションバーのタイトルをある文字列で構成設定します。

source: Configures whether this view participates in hit test operations.
ja: このビューがヒットテスト演算に参加するかどうかを構成設定します。

source: Configuring Context Menu Views
ja: コンテキストメニュービューを構成設定する

source: Configuring Control Attributes
ja: コントロール属性を構成設定する

source: Configuring Navigation and Status Bar Views
ja: ナビゲーションおよびステータスバービューを構成設定する

source: Configuring Navigation and Tab Bar Item Views
ja: ナビゲーションおよびタブバー項目ビューを構成設定する

source: Configuring Previews in Xcode
ja: Xcodeにおいてプレビューを構成設定する

source: Configuring Touch Bar Views
ja: Touch Bar ビューを構成設定する

source: Configuring View Previews
ja: ビュープレビューを構成設定する

source: Configuring Views
ja: ビューを構成設定する

source: Configuring Visibility
ja: 可視性を構成設定する

source: Configuring a Button’s Interaction State
ja: ボタンのもつ相互作用状態を構成設定する

source: Configuring a Button’s Label
ja: ボタンのもつラベルを構成設定する

source: Configuring a List View
ja: リストビューを構成設定する

source: Configuring a Scanner
ja: スキャナーを構成設定する

source: Configuring a Scroll View
ja: スクロールビューを構成設定する

source: Configuring a View for Hit Testing
ja: ヒットテストに対する値を構成設定する

source: Configuring an NSTask Object
ja: NSTaskオブジェクトを構成設定する

source: Configuring the Interface Appearance
ja: インターフェイス外観を構成設定する

source: Configuring the Label View
ja: ラベルビューを構成設定する

source: Configuring the Link
ja: リンクを構成設定する

source: Configuring the Responder Behavior
ja: レスポンダ挙動を構成設定する

source: Configuring the Toggle State
ja: トグル状態を構成設定する

source: Configuring the Toggle Style
ja: トグルスタイルを構成設定する

source: Configuring the View Layout Behavior
ja: ビューレイアウト挙動を構成設定する

source: Conforming Types
ja: これらの型が準拠

source: Conforming types represent a group of related commands that can be exposed to the user via the main menu on macOS and key commands on iOS.
ja: 準拠している型それらは、関連コマンドそれらからなるあるグループを表します、それはユーザにmacOS上でメインメニューおよびiOS上でキーコマンド経由で露出されることが可能です。

source: Conforms To
ja: 次に準拠

source: Conforms when Content conforms to Commands.
ja: ContentがCommandsに準拠する時に準拠します。

source: Conforms when Content conforms to DynamicViewContent and Modifier conforms to ViewModifier.
ja: ContentがDynamicViewContentに準拠するそしてModifierがViewModifierに準拠する時に準拠します。

source: Conforms when Data conforms to RandomAccessCollection, ID conforms to Hashable, and Content conforms to View.
ja: DataがRandomAccessCollectionに準拠する、IDがHashableに準拠する、そしてContentがViewに準拠する時に準拠します。

source: Conforms when Content conforms to Equatable and Modifier conforms to Equatable.
ja: ContentがEquatableに準拠するそしてModifierがEquatableに準拠する時に準拠します。

source: Conforms when Content conforms to InsettableShape.
ja: ContentがInsettableShapeに準拠する時に準拠します。

source: Conforms when Content conforms to View and Modifier conforms to ViewModifier.
ja: ContentがViewに準拠するそしてModifierがViewModifierに準拠する時に準拠します。

source: Conforms when Content conforms to View.
ja: ContentがViewに準拠する時に準拠します。

source: Conforms when Content conforms to ViewModifier and Modifier conforms to ViewModifier.
ja: ContentがViewModifierに準拠するそしてModifierがViewModifierに準拠する時に準拠します。

source: Conforms when Parent conforms to View, Content conforms to View, and Footer conforms to View.
ja: ParentがViewに準拠する、ContentがViewに準拠する、そしてFooterがViewに準拠する時に利用可能です。

source: Conforms when Wrapped conforms to Gesture.
ja: WrappedがGestureに準拠する時に準拠します。

source: Conforms when Wrapped conforms to View.
ja: WrappedがViewに準拠する時に準拠します。

source: Constants
ja: 定数

source: Constants representing an ICU string transform.
ja: ICU文字列変形を表している定数。

source: Constants that define how a view's content fills the available space.
ja: どのようにビューのもつ内容がその利用可能な空間を満たすかを定義する定数。

source: Constants that specify the kind and subkind of DTD declaration represented by an NSXMLDTDNode object.
ja: NSXMLDTDNodeオブジェクトによって表されるDTD宣言の種類と下位種類を指定する定数それら。

source: Constrains the view’s dimensions to the aspect ratio of the specified size.
ja: ビューのもつ次元それらをこの指定された大きさのアスペクト比に強制します。

source: Constrains the view’s dimensions to the specified aspect ratio.
ja: ビューのもつ次元それらをこの指定されたアスペクト比に強制します。

source: Constrains this view’s dimensions to the aspect ratio of the given size.
ja: このビューのもつ次元それらをこの与えらた大きさのアスペクト比へと制約します。

source: Constrains this view’s dimensions to the specified aspect ratio.
ja: このビューのもつ次元それらをこの指定されたアスペクト比へと制約します。

source: Container Views
ja: コンテナビュー

source: Contains the file path of the error.
ja: エラーのファイルパスを含みます。

source: Contextual information about the state of the system that you use to create and update your AppKit view controller.
ja: システムの状態についての前後関係的情報、それはあなたが使用してあなたのAppKitビューコントローラを作成および更新するものです。

source: Contextual information about the state of the system that you use to create and update your AppKit view.
ja: システムの状態についての前後関係的情報、それはあなたが使用してあなたのAppKitビューを作成および更新するものです。

source: Contextual information about the state of the system that you use to create and update your UIKit view controller.
ja: システムの状態についての前後関係的情報、それはあなたが使用してあなたのUIKitビューコントローラを作成および更新するものです。

source: Contextual information about the state of the system that you use to create and update your UIKit view.
ja: システムの状態についての前後関係的情報、それはあなたが使用してあなたのUIKitビューを作成および更新するものです。

source: Contextual information about the state of the system that you use to create and update your WatchKit interface object.
ja: システムの状態についての前後関係的情報、それはあなたが使用してあなたのWatchKitインターフェイスオブジェクトを作成および更新するものです。

source: Contextual information about this key-value pair.
ja: このキー値ペアについての前後関係情報。

source: Continuous actions include things like dragging a slider or pressing and holding a stepper, as opposed to tapping a button.
ja: 連続アクションは、スライダーをドラッグすることまたはステッパーを押すそして保持することのような事柄を含みます、ボタンをタップするのとは対照的に。

source: Continuous curvature rounded rect corners.
ja: 継続的な曲率まるめの矩形角。

source: Contrast Options
ja: コントラストオプション

source: Control and respond to the flow of data and changes within your app’s models.
ja: データの流れおよびあなたのアプリのもつモデル内の変化の制御とそれへの応答。

source: Control the size, position, and appearance attributes of the view.
ja: ビューの大きさ、位置、そして外観等の属性を制御します。

source: Controlling Interaction
ja: 相互作用を制御する

source: Controlling the Layout Direction
ja: レイアウト方向を制御する

source: Controls enable user interaction with consistent APIs that adapt to their platform and context.
ja: コントロールそれらは、首尾一貫したAPIでユーザ相互作用を可能にします、それらはそれらのプラットホームと文脈に合わせて変わります。

source: Controls if the value reported stops at minValue and maxValue or if it should wrap around.
ja: 報告される値がminValueおよびmaxValueで止まるかどうかまたはそれが周りをラップするべきかどうかを制御します。

source: Controls the display order of overlapping views.
ja: ビューの重なりの表示順を制御します。

source: Controls the generation of haptic feedback when turning the Digital Crown.
ja: 「デジタルクラウン」を回している時、触覚フィードバックの発生を制御します。

source: Coordinating Interactions
ja: 相互作用と協調する

source: Coordinating View Controller Interactions
ja: ビューコントローラ相互作用と協調する

source: Coordinating View-Related Interactions
ja: ビュー関連相互作用と協調する

source: Copy the data to the modified view.
ja: データをこの修正されたビューにコピーします。

source: Create Gestures and Update the UI State
ja: ジェスチャを作成するそしてUI状態を更新する

source: Create a UIHostingController object when you want to integrate SwiftUI views into a UIKit view hierarchy.
ja: UIHostingControllerオブジェクトを作成してください、あなたがSwiftUIビューをUIKitビュー階層へと統合したい場合は。

source: Create a Default Navigation View Style
ja: 省略時のナビゲーションビュースタイルを作成する

source: Create a Double Column Navigation View Style
ja: ２カラムナビゲーションビュースタイルを作成する

source: Create a Stack Navigation View Style
ja: スタックナビゲーションビュースタイルを作成する

source: Create a custom view with data driven transitions and animations in SwiftUI.
ja: あつらえのビューをデータ駆動の転換およびアニメーションでSwiftUIにおいて作成します。

source: Create a shared codebase to build a multiplatform app that offers widgets and an app clip.
ja: 共有コードベースを作成することで、ウィジェットとアプリクリップを申し出るマルチプラットフォームアプリを組み立ててください。

source: Create an NSHostingController object when you want to integrate SwiftUI views into an AppKit view hierarchy.
ja: NSHostingControllerオブジェクトを作成します、あなたがSwiftUIビューをAppKitビュー階層へと統合したい場合に。

source: Create an instance that type-erases view.
ja: あるインスタンスを作成します、それは型消去viewです。

source: Create beautiful, dynamic apps faster than ever before.
ja: 美しく、動的なアプリをかつてないほど高速に作成します。

source: Create bindings from members of your state to connect to individual views.
ja: 接続するあなたの状態のメンバーそれらから個々のビューそれらへとバインディングを作成してください。

source: Create custom gestures by combining individual gestures simultaneously or in sequence, and specify actions to perform at each state of a gesture.
ja: 個々のジェスチャを同時的にまたは順番に結合することによってあつらえのジェスチャを作成してください、そしてあるジェスチャの各状態で実行するアクションを指定してください。

source: Create custom gestures by declaring types that conform to the Gesture protocol.
ja: あつらえのジェスチャを、Gestureプロトコルに準拠する型を宣言することによって作成してください。
